; ModuleID = 'Demo1_Bob.bc'
source_filename = "Demo1_Bob.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._Demo1_Access_Key_PROTOCOL = type { {}*, i8* }
%struct._DEMO1_ACCESS_KEY = type { [2 x i64] }
%struct._EFI_RNG_PROTOCOL = type { i64 (%struct._EFI_RNG_PROTOCOL*, i64*, %struct.GUID*)*, i64 (%struct._EFI_RNG_PROTOCOL*, %struct.GUID*, i64, i8*)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct._LINK = type { %struct._DEMO1_ACCESS_KEY, %struct._LINK*, %struct._LINK* }
%struct._Demo1_Bob_PROTOCOL = type { {}* }
%struct.EFI_LOADED_IMAGE_PROTOCOL = type { i32, i8*, %struct.EFI_SYSTEM_TABLE*, i8*, %struct.EFI_DEVICE_PATH_PROTOCOL*, i8*, i32, i8*, i8*, i64, i32, i32, i64 (i8*)* }
%struct.EFI_SYSTEM_TABLE = type { %struct.EFI_TABLE_HEADER, i16*, i32, i8*, %struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, %struct.EFI_RUNTIME_SERVICES*, %struct.EFI_BOOT_SERVICES*, i64, %struct.EFI_CONFIGURATION_TABLE* }
%struct.EFI_TABLE_HEADER = type { i64, i32, i32, i32, i32 }
%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL = type { i64 (%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8)*, i64 (%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, %struct.EFI_INPUT_KEY*)*, i8* }
%struct.EFI_INPUT_KEY = type { i16, i16 }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !620, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "Demo1_Bob.c", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "2e23b53114e1e3bb836e8750f72888b7")
!4 = !{!5, !13, !20, !38, !43, !46}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 112, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./Uefi/UefiMultiPhase.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "3f9ed88dddcb3138696e540e90ddca74")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EfiResetCold", value: 0)
!10 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!11 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!12 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 28, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./Uefi/UefiSpec.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "fea2e09cb9bcf270fd54b16c306ae92d")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!17 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!18 = !DIEnumerator(name: "AllocateAddress", value: 2)
!19 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 38, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!22 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!23 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!24 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!25 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!26 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!27 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!28 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!29 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!30 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!31 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!32 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!33 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!34 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!35 = !DIEnumerator(name: "EfiPalCode", value: 13)
!36 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!37 = !DIEnumerator(name: "EfiMaxMemoryType", value: 15)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 505, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "TimerCancel", value: 0)
!41 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!42 = !DIEnumerator(name: "TimerRelative", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1217, baseType: !7, size: 32, elements: !44)
!44 = !{!45}
!45 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1533, baseType: !7, size: 32, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIEnumerator(name: "AllHandles", value: 0)
!49 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!50 = !DIEnumerator(name: "ByProtocol", value: 2)
!51 = !{!52, !53, !56, !77, !80, !81, !70, !83, !269}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !54, line: 210, baseType: !55)
!54 = !DIFile(filename: "./Uefi/ProcessorBind.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "5a809246aab9e079e163aa7a7e32c6ad")
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINK", file: !58, line: 31, baseType: !59)
!58 = !DIFile(filename: "./../Demo1_Access_Key/Demo1_Access_Key.c", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "96e9715acb360f8fe108fd8b178788c0")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINK", file: !58, line: 33, size: 256, elements: !60)
!60 = !{!61, !75, !76}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "access_key", scope: !59, file: !58, line: 35, baseType: !62, size: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEMO1_ACCESS_KEY", file: !63, line: 23, baseType: !64)
!63 = !DIFile(filename: "./Uefi/UefiBaseType.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "6b596f77ac7c48826eabe4053c19a600")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_DEMO1_ACCESS_KEY", file: !65, line: 225, baseType: !66)
!65 = !DIFile(filename: "./Uefi/Base.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "a7888fa8d0b7ac6c240c247fa85b46e3")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 223, size: 128, elements: !67)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "access_key_store", scope: !66, file: !65, line: 224, baseType: !69, size: 128)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !73)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !54, line: 229, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !54, line: 180, baseType: !72)
!72 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!73 = !{!74}
!74 = !DISubrange(count: 2)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !58, line: 36, baseType: !56, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !58, line: 37, baseType: !56, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !54, line: 234, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !54, line: 184, baseType: !79)
!79 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !65, line: 928, baseType: !70)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !54, line: 214, baseType: !55)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !85, line: 72, baseType: !86)
!85 = !DIFile(filename: "./Protocol/LoadedImage.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 43, size: 768, elements: !87)
!87 = !{!88, !90, !92, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !86, file: !85, line: 44, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !54, line: 188, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !86, file: !85, line: 46, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !63, line: 35, baseType: !52)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !86, file: !85, line: 48, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !14, line: 2115, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 2054, size: 960, elements: !96)
!96 = !{!97, !106, !110, !111, !112, !138, !139, !195, !196, !197, !346, !602, !603}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !95, file: !14, line: 2058, baseType: !98, size: 192)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !6, line: 172, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 145, size: 192, elements: !100)
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !99, file: !6, line: 151, baseType: !71, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !99, file: !6, line: 158, baseType: !89, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !99, file: !6, line: 162, baseType: !89, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !99, file: !6, line: 167, baseType: !89, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !99, file: !6, line: 171, baseType: !89, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !95, file: !14, line: 2063, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !54, line: 201, baseType: !109)
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !95, file: !14, line: 2068, baseType: !89, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !95, file: !14, line: 2073, baseType: !91, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !95, file: !14, line: 2078, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !115, line: 20, baseType: !116)
!115 = !DIFile(filename: "./Uefi/Protocol/SimpleTextIn.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !115, line: 116, size: 192, elements: !117)
!117 = !{!118, !124, !136}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !116, file: !115, line: 117, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !115, line: 86, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !113, !53}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !63, line: 31, baseType: !80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !116, file: !115, line: 118, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !115, line: 107, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!123, !113, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !115, line: 38, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 35, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !131, file: !115, line: 36, baseType: !134, size: 16)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !54, line: 196, baseType: !109)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !131, file: !115, line: 37, baseType: !108, size: 16, offset: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !116, file: !115, line: 122, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !63, line: 39, baseType: !52)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !95, file: !14, line: 2082, baseType: !91, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !95, file: !14, line: 2087, baseType: !140, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !142, line: 27, baseType: !143)
!142 = !DIFile(filename: "./Uefi/Protocol/SimpleTextOut.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !142, line: 387, size: 640, elements: !144)
!144 = !{!145, !150, !155, !157, !163, !168, !170, !175, !180, !182}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !143, file: !142, line: 388, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !142, line: 167, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!123, !140, !53}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !143, file: !142, line: 390, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !142, line: 192, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!123, !140, !107}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !143, file: !142, line: 391, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !142, line: 213, baseType: !152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !143, file: !142, line: 393, baseType: !158, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !142, line: 236, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!123, !140, !70, !162, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !143, file: !142, line: 394, baseType: !164, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !142, line: 256, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!123, !140, !70}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !143, file: !142, line: 395, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !142, line: 277, baseType: !165)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !143, file: !142, line: 397, baseType: !171, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !142, line: 295, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!123, !140}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !143, file: !142, line: 398, baseType: !176, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !142, line: 318, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!123, !140, !70, !70}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !143, file: !142, line: 399, baseType: !181, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !142, line: 340, baseType: !147)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !143, file: !142, line: 404, baseType: !183, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !142, line: 379, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 349, size: 192, elements: !186)
!186 = !{!187, !190, !191, !192, !193, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !185, file: !142, line: 353, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !54, line: 192, baseType: !189)
!189 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !185, file: !142, line: 362, baseType: !188, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !185, file: !142, line: 366, baseType: !188, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !185, file: !142, line: 370, baseType: !188, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !185, file: !142, line: 374, baseType: !188, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !185, file: !142, line: 378, baseType: !53, size: 8, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !95, file: !14, line: 2092, baseType: !91, size: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !95, file: !14, line: 2097, baseType: !140, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !95, file: !14, line: 2101, baseType: !198, size: 64, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1933, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 1886, size: 1216, elements: !201)
!201 = !{!202, !203, !232, !237, !243, !248, !264, !270, !288, !293, !298, !304, !309, !314, !320, !334, !341}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !200, file: !14, line: 1890, baseType: !98, size: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !200, file: !14, line: 1895, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !14, line: 874, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!123, !208, !225}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !63, line: 82, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 70, size: 128, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !223, !224}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !210, file: !63, line: 71, baseType: !134, size: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !210, file: !63, line: 72, baseType: !82, size: 8, offset: 16)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !210, file: !63, line: 73, baseType: !82, size: 8, offset: 24)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !210, file: !63, line: 74, baseType: !82, size: 8, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !210, file: !63, line: 75, baseType: !82, size: 8, offset: 40)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !210, file: !63, line: 76, baseType: !82, size: 8, offset: 48)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !210, file: !63, line: 77, baseType: !82, size: 8, offset: 56)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !210, file: !63, line: 78, baseType: !89, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !210, file: !63, line: 79, baseType: !221, size: 16, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !54, line: 205, baseType: !222)
!222 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !210, file: !63, line: 80, baseType: !82, size: 8, offset: 112)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !210, file: !63, line: 81, baseType: !82, size: 8, offset: 120)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !14, line: 857, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 834, size: 96, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !227, file: !14, line: 841, baseType: !89, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !227, file: !14, line: 848, baseType: !89, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !227, file: !14, line: 856, baseType: !53, size: 8, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !200, file: !14, line: 1896, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !14, line: 891, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!123, !208}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !200, file: !14, line: 1897, baseType: !238, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !14, line: 912, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!123, !242, !242, !208}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !200, file: !14, line: 1898, baseType: !244, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !14, line: 934, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!123, !53, !208}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !200, file: !14, line: 1903, baseType: !249, size: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !14, line: 311, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!123, !70, !70, !89, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 159, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 127, size: 320, elements: !256)
!256 = !{!257, !258, !260, !262, !263}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !255, file: !14, line: 133, baseType: !89, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !255, file: !14, line: 139, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !63, line: 52, baseType: !71)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !255, file: !14, line: 145, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !63, line: 57, baseType: !71)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !255, file: !14, line: 152, baseType: !71, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !255, file: !14, line: 158, baseType: !71, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !200, file: !14, line: 1904, baseType: !265, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !14, line: 406, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!123, !70, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !200, file: !14, line: 1909, baseType: !271, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !14, line: 670, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!123, !107, !275, !287, !162, !52}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !63, line: 27, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !65, line: 218, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 213, size: 128, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !278, file: !65, line: 214, baseType: !89, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !278, file: !65, line: 215, baseType: !134, size: 16, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !278, file: !65, line: 216, baseType: !134, size: 16, offset: 48)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !278, file: !65, line: 217, baseType: !284, size: 64, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 8)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !200, file: !14, line: 1910, baseType: !289, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !14, line: 739, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!123, !162, !107, !275}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !200, file: !14, line: 1911, baseType: !294, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !14, line: 781, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!123, !107, !275, !89, !70, !52}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "GetAccessVariable", scope: !200, file: !14, line: 1914, baseType: !299, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_ACCESS_VARIABLE", file: !14, line: 703, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!123, !107, !275, !287, !303, !162, !52}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "SetAccessVariable", scope: !200, file: !14, line: 1915, baseType: !305, size: 64, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_ACCESS_VARIABLE", file: !14, line: 822, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!123, !107, !275, !89, !303, !70, !52}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !200, file: !14, line: 1920, baseType: !310, size: 64, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !14, line: 1155, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !287}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !200, file: !14, line: 1921, baseType: !315, size: 64, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !14, line: 1120, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !319, !123, !70, !52}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !6, line: 140, baseType: !5)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !200, file: !14, line: 1926, baseType: !321, size: 64, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !14, line: 1781, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!123, !325, !70, !259}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !14, line: 1727, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 1706, size: 224, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !328, file: !14, line: 1710, baseType: !276, size: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !328, file: !14, line: 1716, baseType: !89, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !328, file: !14, line: 1722, baseType: !89, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !328, file: !14, line: 1726, baseType: !89, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !200, file: !14, line: 1927, baseType: !335, size: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !14, line: 1812, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!123, !325, !70, !339, !340}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !200, file: !14, line: 1932, baseType: !342, size: 64, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !14, line: 1843, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!123, !89, !339, !339, !339}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !95, file: !14, line: 2105, baseType: !347, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !14, line: 2034, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 1941, size: 3008, elements: !350)
!350 = !{!351, !352, !358, !363, !371, !376, !381, !386, !391, !401, !407, !412, !417, !419, !421, !428, !433, !438, !443, !444, !449, !455, !470, !475, !480, !486, !491, !496, !501, !506, !511, !516, !521, !526, !531, !536, !550, !557, !563, !568, !573, !578, !583, !588, !593}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !349, file: !14, line: 1945, baseType: !98, size: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !349, file: !14, line: 1950, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !14, line: 628, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !63, line: 43, baseType: !70)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !349, file: !14, line: 1951, baseType: !359, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !14, line: 640, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !357}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !349, file: !14, line: 1956, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !14, line: 187, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!123, !368, !369, !70, !370}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !14, line: 46, baseType: !13)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !6, line: 107, baseType: !20)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !349, file: !14, line: 1957, baseType: !372, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !14, line: 208, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!123, !259, !70}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !349, file: !14, line: 1958, baseType: !377, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !14, line: 240, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!123, !162, !253, !162, !162, !287}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !349, file: !14, line: 1959, baseType: !382, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !14, line: 269, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!123, !369, !70, !269}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !349, file: !14, line: 1960, baseType: !387, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !14, line: 286, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!123, !52}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !349, file: !14, line: 1965, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !14, line: 464, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!123, !89, !357, !396, !52, !400}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !14, line: 441, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !137, !52}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !349, file: !14, line: 1966, baseType: !402, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !14, line: 538, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!123, !137, !406, !71}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !14, line: 518, baseType: !38)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !349, file: !14, line: 1967, baseType: !408, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !14, line: 574, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!123, !70, !400, !162}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !349, file: !14, line: 1968, baseType: !413, size: 64, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !14, line: 554, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!123, !137}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !349, file: !14, line: 1969, baseType: !418, size: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !14, line: 590, baseType: !414)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !349, file: !14, line: 1970, baseType: !420, size: 64, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !14, line: 606, baseType: !414)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !349, file: !14, line: 1975, baseType: !422, size: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !14, line: 1246, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!123, !426, !275, !427, !52}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !14, line: 1222, baseType: !43)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !349, file: !14, line: 1976, baseType: !429, size: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1296, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!123, !91, !275, !52, !52}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !349, file: !14, line: 1977, baseType: !434, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1322, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!123, !91, !275, !52}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !349, file: !14, line: 1978, baseType: !439, size: 64, offset: 1216)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !14, line: 1363, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!123, !91, !275, !269}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !349, file: !14, line: 1979, baseType: !52, size: 64, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !349, file: !14, line: 1980, baseType: !445, size: 64, offset: 1344)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !14, line: 1524, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!123, !275, !137, !269}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !349, file: !14, line: 1981, baseType: !450, size: 64, offset: 1408)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !14, line: 1573, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!123, !454, !275, !52, !162, !426}
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !14, line: 1547, baseType: !46)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !349, file: !14, line: 1982, baseType: !456, size: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !14, line: 1599, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!123, !275, !460, !426}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !463, line: 58, baseType: !464)
!463 = !DIFile(filename: "./Uefi/Protocol/DevicePath.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "b97c129759f8893462bd2c573bd0d83a")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 43, size: 32, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !464, file: !463, line: 44, baseType: !82, size: 8)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !464, file: !463, line: 51, baseType: !82, size: 8, offset: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !464, file: !463, line: 56, baseType: !469, size: 16, offset: 16)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 16, elements: !73)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !349, file: !14, line: 1983, baseType: !471, size: 64, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !14, line: 1620, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!123, !275, !52}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !349, file: !14, line: 1988, baseType: !476, size: 64, offset: 1600)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !14, line: 971, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!123, !53, !91, !461, !52, !70, !426}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !349, file: !14, line: 1989, baseType: !481, size: 64, offset: 1664)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !14, line: 996, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!123, !91, !162, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !349, file: !14, line: 1990, baseType: !487, size: 64, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !14, line: 1024, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!123, !91, !123, !70, !107}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !349, file: !14, line: 1991, baseType: !492, size: 64, offset: 1792)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !14, line: 1042, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!123, !91}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !349, file: !14, line: 1992, baseType: !497, size: 64, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !14, line: 1058, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!123, !91, !70}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !349, file: !14, line: 1997, baseType: !502, size: 64, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !14, line: 1139, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!123, !339}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !349, file: !14, line: 1998, baseType: !507, size: 64, offset: 1984)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !14, line: 1074, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!123, !70}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !349, file: !14, line: 1999, baseType: !512, size: 64, offset: 2048)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !14, line: 1096, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!123, !70, !71, !70, !107}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !349, file: !14, line: 2004, baseType: !517, size: 64, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !14, line: 345, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!123, !91, !426, !461, !53}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !349, file: !14, line: 2005, baseType: !522, size: 64, offset: 2176)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !14, line: 378, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!123, !91, !91, !91}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !349, file: !14, line: 2010, baseType: !527, size: 64, offset: 2240)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !14, line: 1405, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!123, !91, !275, !269, !91, !91, !89}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !349, file: !14, line: 2011, baseType: !532, size: 64, offset: 2304)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !14, line: 1437, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!123, !91, !275, !91, !91}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !349, file: !14, line: 2012, baseType: !537, size: 64, offset: 2368)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !14, line: 1471, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!123, !91, !275, !541, !162}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1452, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 1447, size: 192, elements: !545)
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !544, file: !14, line: 1448, baseType: !91, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !544, file: !14, line: 1449, baseType: !91, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !544, file: !14, line: 1450, baseType: !89, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !544, file: !14, line: 1451, baseType: !89, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !349, file: !14, line: 2017, baseType: !551, size: 64, offset: 2432)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !14, line: 1501, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!123, !91, !555, !162}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !349, file: !14, line: 2018, baseType: !558, size: 64, offset: 2496)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !14, line: 1646, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!123, !454, !275, !52, !162, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !349, file: !14, line: 2019, baseType: !564, size: 64, offset: 2560)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !14, line: 1673, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!123, !275, !52, !269}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !349, file: !14, line: 2020, baseType: !569, size: 64, offset: 2624)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1271, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!123, !426, null}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !349, file: !14, line: 2021, baseType: !574, size: 64, offset: 2688)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1341, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!123, !91, null}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !349, file: !14, line: 2026, baseType: !579, size: 64, offset: 2752)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !14, line: 1176, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!123, !52, !70, !287}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !349, file: !14, line: 2031, baseType: !584, size: 64, offset: 2816)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !14, line: 1192, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !52, !52, !70}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !349, file: !14, line: 2032, baseType: !589, size: 64, offset: 2880)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !14, line: 1208, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !52, !70, !82}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !349, file: !14, line: 2033, baseType: !594, size: 64, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !14, line: 493, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!123, !89, !357, !396, !598, !600, !400}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !95, file: !14, line: 2109, baseType: !70, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !95, file: !14, line: 2114, baseType: !604, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 2049, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 2040, size: 192, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !606, file: !14, line: 2044, baseType: !276, size: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !606, file: !14, line: 2048, baseType: !52, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !86, file: !85, line: 53, baseType: !91, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "FilePath", scope: !86, file: !85, line: 54, baseType: !461, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !86, file: !85, line: 56, baseType: !52, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptionsSize", scope: !86, file: !85, line: 61, baseType: !89, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptions", scope: !86, file: !85, line: 62, baseType: !52, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !86, file: !85, line: 67, baseType: !52, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !86, file: !85, line: 68, baseType: !71, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeType", scope: !86, file: !85, line: 69, baseType: !369, size: 32, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataType", scope: !86, file: !85, line: 70, baseType: !369, size: 32, offset: 672)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Unload", scope: !86, file: !85, line: 71, baseType: !492, size: 64, offset: 704)
!620 = !{!0, !621, !640, !642, !644, !646, !648, !650, !662, !675, !677, !679, !681, !694}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "RngProtocol", scope: !2, file: !58, line: 24, type: !623, isLocal: false, isDefinition: true)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_PROTOCOL", file: !625, line: 22, baseType: !626)
!625 = !DIFile(filename: "./../Demo1_Alice/../Demo1_Access_Key/Protocol/Rng.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "1128b15f0582c0f8bfa33dc5c07b9582")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_RNG_PROTOCOL", file: !625, line: 137, size: 128, elements: !627)
!627 = !{!628, !635}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !626, file: !625, line: 138, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_GET_INFO", file: !625, line: 96, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!123, !623, !162, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_ALGORITHM", file: !625, line: 30, baseType: !276)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GetRNG", scope: !626, file: !625, line: 139, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_GET_RNG", file: !625, line: 126, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!123, !623, !633, !70, !81}
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "masterKey", scope: !2, file: !58, line: 25, type: !303, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "accessKeyLock", scope: !2, file: !58, line: 28, type: !53, isLocal: false, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !58, line: 40, type: !56, isLocal: false, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "last", scope: !2, file: !58, line: 41, type: !56, isLocal: false, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "keychain", scope: !2, file: !58, line: 42, type: !56, isLocal: false, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "gDemo1_Bob_Protocol", scope: !2, file: !3, line: 20, type: !652, isLocal: false, isDefinition: true)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Bob_PROTOCOL", file: !653, line: 35, baseType: !654)
!653 = !DIFile(filename: "./Demo1_Bob.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "4fa74dec5a92cd7311066f39f790ce53")
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Bob_PROTOCOL", file: !653, line: 52, size: 64, elements: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1BobDataProvider", scope: !654, file: !653, line: 53, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOB_CB_TYPE", file: !653, line: 42, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!123, !661, !52, !269, !70}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "AccessKeyProtocol", scope: !2, file: !3, line: 25, type: !664, isLocal: false, isDefinition: true)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Access_Key_PROTOCOL", file: !666, line: 36, baseType: !667)
!666 = !DIFile(filename: "./../Demo1_Access_Key/Demo1_Access_Key.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "a5dbaf8c3ac310b99ce95abca155b547")
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Access_Key_PROTOCOL", file: !666, line: 72, size: 128, elements: !668)
!668 = !{!669, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1GenerateAccessKey", scope: !667, file: !666, line: 73, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRVR_FUNC_CB_TYPE1", file: !666, line: 51, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!123, !664, !91, !53, !303}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1_Ready_To_Lock_Event", scope: !667, file: !666, line: 75, baseType: !137, size: 64, offset: 64)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "Demo1_Bob_PeriodicTimer", scope: !2, file: !3, line: 30, type: !137, isLocal: false, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "DataToProvide", scope: !2, file: !3, line: 31, type: !70, isLocal: false, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "gLoadImage", scope: !2, file: !3, line: 32, type: !83, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "AliceProtocol", scope: !2, file: !3, line: 26, type: !683, isLocal: false, isDefinition: true)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Alice_PROTOCOL", file: !685, line: 36, baseType: !686)
!685 = !DIFile(filename: "./../Demo1_Alice/Demo1_Alice.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "a1a6c09027689aba8f236cb5bb922cff")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Alice_PROTOCOL", file: !685, line: 56, size: 128, elements: !687)
!687 = !{!688, !693}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1AliceProvideData", scope: !686, file: !685, line: 57, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALICE_CB_TYPE", file: !685, line: 47, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!123, !683, !91, !162}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1_Ready_To_Run_Event", scope: !686, file: !685, line: 58, baseType: !137, size: 64, offset: 64)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "bobKey", scope: !2, file: !3, line: 29, type: !62, isLocal: false, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "/home/hira/Research/klee/runtime/Freestanding/memcpy.c", directory: "/home/hira/Research/klee_build/runtime/Freestanding", checksumkind: CSK_MD5, checksum: "8fb9a7164e167db005d7d002570068bc")
!698 = !{i32 7, !"Dwarf Version", i32 5}
!699 = !{i32 2, !"Debug Info Version", i32 3}
!700 = !{i32 1, !"wchar_size", i32 4}
!701 = !{i32 7, !"PIC Level", i32 2}
!702 = !{i32 7, !"PIE Level", i32 2}
!703 = !{i32 7, !"uwtable", i32 1}
!704 = !{i32 7, !"frame-pointer", i32 2}
!705 = !{!"Ubuntu clang version 14.0.6"}
!706 = distinct !DISubprogram(name: "Demo1GenerateAccessKey", scope: !58, file: !58, line: 295, type: !672, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !707)
!707 = !{}
!708 = !DILocalVariable(name: "This", arg: 1, scope: !706, file: !58, line: 296, type: !664)
!709 = !DILocation(line: 296, column: 35, scope: !706)
!710 = !DILocalVariable(name: "Controller", arg: 2, scope: !706, file: !58, line: 297, type: !91)
!711 = !DILocation(line: 297, column: 19, scope: !706)
!712 = !DILocalVariable(name: "WriteAccess", arg: 3, scope: !706, file: !58, line: 298, type: !53)
!713 = !DILocation(line: 298, column: 16, scope: !706)
!714 = !DILocalVariable(name: "AccessKeyPtr", arg: 4, scope: !706, file: !58, line: 299, type: !303)
!715 = !DILocation(line: 299, column: 30, scope: !706)
!716 = !DILocalVariable(name: "Status", scope: !706, file: !58, line: 302, type: !123)
!717 = !DILocation(line: 302, column: 14, scope: !706)
!718 = !DILocalVariable(name: "header", scope: !706, file: !58, line: 303, type: !70)
!719 = !DILocation(line: 303, column: 9, scope: !706)
!720 = !DILocation(line: 306, column: 7, scope: !721)
!721 = distinct !DILexicalBlock(scope: !706, file: !58, line: 306, column: 7)
!722 = !DILocation(line: 306, column: 20, scope: !721)
!723 = !DILocation(line: 306, column: 7, scope: !706)
!724 = !DILocation(line: 308, column: 5, scope: !725)
!725 = distinct !DILexicalBlock(scope: !721, file: !58, line: 307, column: 3)
!726 = !DILocation(line: 311, column: 7, scope: !727)
!727 = distinct !DILexicalBlock(scope: !706, file: !58, line: 311, column: 7)
!728 = !DILocation(line: 311, column: 21, scope: !727)
!729 = !DILocation(line: 311, column: 7, scope: !706)
!730 = !DILocation(line: 313, column: 5, scope: !731)
!731 = distinct !DILexicalBlock(scope: !727, file: !58, line: 312, column: 3)
!732 = !DILocation(line: 317, column: 12, scope: !706)
!733 = !DILocation(line: 317, column: 25, scope: !706)
!734 = !DILocation(line: 317, column: 32, scope: !706)
!735 = !DILocation(line: 317, column: 70, scope: !706)
!736 = !DILocation(line: 317, column: 84, scope: !706)
!737 = !DILocation(line: 317, column: 60, scope: !706)
!738 = !DILocation(line: 317, column: 10, scope: !706)
!739 = !DILocation(line: 318, column: 7, scope: !740)
!740 = distinct !DILexicalBlock(scope: !706, file: !58, line: 318, column: 7)
!741 = !DILocation(line: 318, column: 7, scope: !706)
!742 = !DILocation(line: 320, column: 12, scope: !743)
!743 = distinct !DILexicalBlock(scope: !740, file: !58, line: 319, column: 3)
!744 = !DILocation(line: 320, column: 5, scope: !743)
!745 = !DILocation(line: 324, column: 7, scope: !746)
!746 = distinct !DILexicalBlock(scope: !706, file: !58, line: 324, column: 7)
!747 = !DILocation(line: 324, column: 7, scope: !706)
!748 = !DILocation(line: 326, column: 12, scope: !749)
