; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.siggetmask"
module asm "\09.previous"
module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"
module asm ".section .gnu.warning.gets"
module asm "\09.previous"
module asm ".section .gnu.warning.tmpnam"
module asm "\09.previous"
module asm ".section .gnu.warning.mktemp"
module asm "\09.previous"

%struct._Demo1_Access_Key_PROTOCOL = type { {}*, i8* }
%struct._DEMO1_ACCESS_KEY = type { [2 x i64] }
%struct._EFI_RNG_PROTOCOL = type { i64 (%struct._EFI_RNG_PROTOCOL*, i64*, %struct.GUID*)*, i64 (%struct._EFI_RNG_PROTOCOL*, %struct.GUID*, i64, i8*)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct._LINK = type { %struct._DEMO1_ACCESS_KEY, %struct._LINK*, %struct._LINK* }
%struct._Demo1_Bob_PROTOCOL = type { {}* }
%struct.EFI_LOADED_IMAGE_PROTOCOL = type { i32, i8*, %struct.EFI_SYSTEM_TABLE*, i8*, %struct.EFI_DEVICE_PATH_PROTOCOL*, i8*, i32, i8*, i8*, i64, i32, i32, i64 (i8*)* }
%struct.EFI_SYSTEM_TABLE = type { %struct.EFI_TABLE_HEADER, i16*, i32, i8*, %struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, %struct.EFI_RUNTIME_SERVICES*, %struct.EFI_BOOT_SERVICES*, i64, %struct.EFI_CONFIGURATION_TABLE* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/hira/Research/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/hira/Research/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/hira/Research/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-11/lib/clang/11.1.0/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__evoke_link_warning_siggetmask", scope: !53, file: !54, line: 31, type: !56, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "libc/signal/siggetmask.c", directory: "/home/hira/Research/klee-uclibc")
!55 = !{!51}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 456, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 57)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !61, file: !62, line: 24, type: !64, isLocal: true, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !63, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/home/hira/Research/klee-uclibc")
!63 = !{!59}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 167)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "__evoke_link_warning_gets", scope: !69, file: !70, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !71, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "libc/stdio/gets.c", directory: "/home/hira/Research/klee-uclibc")
!71 = !{!67}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "tmpnam_buffer", scope: !74, file: !75, line: 25, type: !83, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !77, splitDebugInlining: false, nameTableKind: None)
!75 = !DIFile(filename: "libc/stdio/tmpnam.c", directory: "/home/hira/Research/klee-uclibc")
!76 = !{!6, !7}
!77 = !{!78, !72}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "__evoke_link_warning_tmpnam", scope: !74, file: !75, line: 54, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 55)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "__evoke_link_warning_mktemp", scope: !88, file: !89, line: 35, type: !80, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, splitDebugInlining: false, nameTableKind: None)
!89 = !DIFile(filename: "libc/stdlib/mktemp.c", directory: "/home/hira/Research/klee-uclibc")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "gDemo1_Access_Key_Protocol", scope: !93, file: !148, line: 18, type: !754, isLocal: false, isDefinition: true)
!93 = distinct !DICompileUnit(language: DW_LANG_C99, file: !94, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !142, globals: !709, splitDebugInlining: false, nameTableKind: None)
!94 = !DIFile(filename: "Demo1_Bob.c", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "eb37217c678bc7011354cab042db4995")
!95 = !{!96, !104, !111, !129, !134, !137}
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 112, baseType: !98, size: 32, elements: !99)
!97 = !DIFile(filename: "./Uefi/UefiMultiPhase.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "3f9ed88dddcb3138696e540e90ddca74")
!98 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "EfiResetCold", value: 0)
!101 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!102 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!103 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 28, baseType: !98, size: 32, elements: !106)
!105 = !DIFile(filename: "./Uefi/UefiSpec.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "fea2e09cb9bcf270fd54b16c306ae92d")
!106 = !{!107, !108, !109, !110}
!107 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!108 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!109 = !DIEnumerator(name: "AllocateAddress", value: 2)
!110 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 38, baseType: !98, size: 32, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!113 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!114 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!115 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!116 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!117 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!118 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!119 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!120 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!121 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!122 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!123 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!124 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!125 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!126 = !DIEnumerator(name: "EfiPalCode", value: 13)
!127 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!128 = !DIEnumerator(name: "EfiMaxMemoryType", value: 15)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 505, baseType: !98, size: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "TimerCancel", value: 0)
!132 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!133 = !DIEnumerator(name: "TimerRelative", value: 2)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1217, baseType: !98, size: 32, elements: !135)
!135 = !{!136}
!136 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1533, baseType: !98, size: 32, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIEnumerator(name: "AllHandles", value: 0)
!140 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!141 = !DIEnumerator(name: "ByProtocol", value: 2)
!142 = !{!6, !143, !146, !167, !170, !171, !160, !173, !358}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !144, line: 210, baseType: !145)
!144 = !DIFile(filename: "./Uefi/ProcessorBind.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "5a809246aab9e079e163aa7a7e32c6ad")
!145 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINK", file: !148, line: 31, baseType: !149)
!148 = !DIFile(filename: "./../Demo1_Access_Key/Demo1_Access_Key.c", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "96e9715acb360f8fe108fd8b178788c0")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINK", file: !148, line: 33, size: 256, elements: !150)
!150 = !{!151, !165, !166}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "access_key", scope: !149, file: !148, line: 35, baseType: !152, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEMO1_ACCESS_KEY", file: !153, line: 23, baseType: !154)
!153 = !DIFile(filename: "./Uefi/UefiBaseType.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "6b596f77ac7c48826eabe4053c19a600")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "_DEMO1_ACCESS_KEY", file: !155, line: 225, baseType: !156)
!155 = !DIFile(filename: "./Uefi/Base.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "a7888fa8d0b7ac6c240c247fa85b46e3")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 223, size: 128, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "access_key_store", scope: !156, file: !155, line: 224, baseType: !159, size: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !163)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !144, line: 229, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !144, line: 180, baseType: !162)
!162 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!163 = !{!164}
!164 = !DISubrange(count: 2)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !148, line: 36, baseType: !146, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !148, line: 37, baseType: !146, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !144, line: 234, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !144, line: 184, baseType: !169)
!169 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !155, line: 928, baseType: !160)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !144, line: 214, baseType: !145)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !175, line: 72, baseType: !176)
!175 = !DIFile(filename: "./Protocol/LoadedImage.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 43, size: 768, elements: !177)
!177 = !{!178, !180, !182, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !176, file: !175, line: 44, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !144, line: 188, baseType: !98)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !176, file: !175, line: 46, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !153, line: 35, baseType: !6)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !176, file: !175, line: 48, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !105, line: 2115, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 2054, size: 960, elements: !186)
!186 = !{!187, !196, !200, !201, !202, !228, !229, !284, !285, !286, !435, !691, !692}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !185, file: !105, line: 2058, baseType: !188, size: 192)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !97, line: 172, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 145, size: 192, elements: !190)
!190 = !{!191, !192, !193, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !189, file: !97, line: 151, baseType: !161, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !189, file: !97, line: 158, baseType: !179, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !189, file: !97, line: 162, baseType: !179, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !189, file: !97, line: 167, baseType: !179, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !189, file: !97, line: 171, baseType: !179, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !185, file: !105, line: 2063, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !144, line: 201, baseType: !199)
!199 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !185, file: !105, line: 2068, baseType: !179, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !185, file: !105, line: 2073, baseType: !181, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !185, file: !105, line: 2078, baseType: !203, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !205, line: 20, baseType: !206)
!205 = !DIFile(filename: "./Uefi/Protocol/SimpleTextIn.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !205, line: 116, size: 192, elements: !207)
!207 = !{!208, !214, !226}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !206, file: !205, line: 117, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !205, line: 86, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !203, !143}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !153, line: 31, baseType: !170)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !206, file: !205, line: 118, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !205, line: 107, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!213, !203, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !205, line: 38, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 35, size: 32, elements: !222)
!222 = !{!223, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !221, file: !205, line: 36, baseType: !224, size: 16)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !144, line: 196, baseType: !199)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !221, file: !205, line: 37, baseType: !198, size: 16, offset: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !206, file: !205, line: 122, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !153, line: 39, baseType: !6)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !185, file: !105, line: 2082, baseType: !181, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !185, file: !105, line: 2087, baseType: !230, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !232, line: 27, baseType: !233)
!232 = !DIFile(filename: "./Uefi/Protocol/SimpleTextOut.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !232, line: 387, size: 640, elements: !234)
!234 = !{!235, !240, !245, !247, !253, !258, !260, !265, !270, !272}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !233, file: !232, line: 388, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !232, line: 167, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!213, !230, !143}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !233, file: !232, line: 390, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !232, line: 192, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!213, !230, !197}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !233, file: !232, line: 391, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !232, line: 213, baseType: !242)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !233, file: !232, line: 393, baseType: !248, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !232, line: 236, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!213, !230, !160, !252, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !233, file: !232, line: 394, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !232, line: 256, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!213, !230, !160}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !233, file: !232, line: 395, baseType: !259, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !232, line: 277, baseType: !255)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !233, file: !232, line: 397, baseType: !261, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !232, line: 295, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!213, !230}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !233, file: !232, line: 398, baseType: !266, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !232, line: 318, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!213, !230, !160, !160}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !233, file: !232, line: 399, baseType: !271, size: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !232, line: 340, baseType: !237)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !233, file: !232, line: 404, baseType: !273, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !232, line: 379, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 349, size: 192, elements: !276)
!276 = !{!277, !279, !280, !281, !282, !283}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !275, file: !232, line: 353, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !144, line: 192, baseType: !45)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !275, file: !232, line: 362, baseType: !278, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !275, file: !232, line: 366, baseType: !278, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !275, file: !232, line: 370, baseType: !278, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !275, file: !232, line: 374, baseType: !278, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !275, file: !232, line: 378, baseType: !143, size: 8, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !185, file: !105, line: 2092, baseType: !181, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !185, file: !105, line: 2097, baseType: !230, size: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !185, file: !105, line: 2101, baseType: !287, size: 64, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !105, line: 1933, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 1886, size: 1216, elements: !290)
!290 = !{!291, !292, !321, !326, !332, !337, !353, !359, !377, !382, !387, !393, !398, !403, !409, !423, !430}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !289, file: !105, line: 1890, baseType: !188, size: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !289, file: !105, line: 1895, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !105, line: 874, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!213, !297, !314}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !153, line: 82, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 70, size: 128, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !312, !313}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !299, file: !153, line: 71, baseType: !224, size: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !299, file: !153, line: 72, baseType: !172, size: 8, offset: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !299, file: !153, line: 73, baseType: !172, size: 8, offset: 24)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !299, file: !153, line: 74, baseType: !172, size: 8, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !299, file: !153, line: 75, baseType: !172, size: 8, offset: 40)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !299, file: !153, line: 76, baseType: !172, size: 8, offset: 48)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !299, file: !153, line: 77, baseType: !172, size: 8, offset: 56)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !299, file: !153, line: 78, baseType: !179, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !299, file: !153, line: 79, baseType: !310, size: 16, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !144, line: 205, baseType: !311)
!311 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !299, file: !153, line: 80, baseType: !172, size: 8, offset: 112)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !299, file: !153, line: 81, baseType: !172, size: 8, offset: 120)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !105, line: 857, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 834, size: 96, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !316, file: !105, line: 841, baseType: !179, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !316, file: !105, line: 848, baseType: !179, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !316, file: !105, line: 856, baseType: !143, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !289, file: !105, line: 1896, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !105, line: 891, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!213, !297}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !289, file: !105, line: 1897, baseType: !327, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !105, line: 912, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!213, !331, !331, !297}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !289, file: !105, line: 1898, baseType: !333, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !105, line: 934, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!213, !143, !297}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !289, file: !105, line: 1903, baseType: !338, size: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !105, line: 311, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!213, !160, !160, !179, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !105, line: 159, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 127, size: 320, elements: !345)
!345 = !{!346, !347, !349, !351, !352}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !344, file: !105, line: 133, baseType: !179, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !344, file: !105, line: 139, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !153, line: 52, baseType: !161)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !344, file: !105, line: 145, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !153, line: 57, baseType: !161)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !344, file: !105, line: 152, baseType: !161, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !344, file: !105, line: 158, baseType: !161, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !289, file: !105, line: 1904, baseType: !354, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !105, line: 406, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!213, !160, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !289, file: !105, line: 1909, baseType: !360, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !105, line: 670, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!213, !197, !364, !376, !252, !6}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !153, line: 27, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !155, line: 218, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 213, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !367, file: !155, line: 214, baseType: !179, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !367, file: !155, line: 215, baseType: !224, size: 16, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !367, file: !155, line: 216, baseType: !224, size: 16, offset: 48)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !367, file: !155, line: 217, baseType: !373, size: 64, offset: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !289, file: !105, line: 1910, baseType: !378, size: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !105, line: 739, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!213, !252, !197, !364}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !289, file: !105, line: 1911, baseType: !383, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !105, line: 781, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!213, !197, !364, !179, !160, !6}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "GetAccessVariable", scope: !289, file: !105, line: 1914, baseType: !388, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_ACCESS_VARIABLE", file: !105, line: 703, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!213, !197, !364, !376, !392, !252, !6}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "SetAccessVariable", scope: !289, file: !105, line: 1915, baseType: !394, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_ACCESS_VARIABLE", file: !105, line: 822, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!213, !197, !364, !179, !392, !160, !6}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !289, file: !105, line: 1920, baseType: !399, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !105, line: 1155, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!213, !376}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !289, file: !105, line: 1921, baseType: !404, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !105, line: 1120, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408, !213, !160, !6}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !97, line: 140, baseType: !96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !289, file: !105, line: 1926, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !105, line: 1781, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!213, !414, !160, !348}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !105, line: 1727, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 1706, size: 224, elements: !418)
!418 = !{!419, !420, !421, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !417, file: !105, line: 1710, baseType: !365, size: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !417, file: !105, line: 1716, baseType: !179, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !417, file: !105, line: 1722, baseType: !179, size: 32, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !417, file: !105, line: 1726, baseType: !179, size: 32, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !289, file: !105, line: 1927, baseType: !424, size: 64, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !105, line: 1812, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!213, !414, !160, !428, !429}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !289, file: !105, line: 1932, baseType: !431, size: 64, offset: 1152)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !105, line: 1843, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!213, !179, !428, !428, !428}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !185, file: !105, line: 2105, baseType: !436, size: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !105, line: 2034, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 1941, size: 3008, elements: !439)
!439 = !{!440, !441, !447, !452, !460, !465, !470, !475, !480, !490, !496, !501, !506, !508, !510, !517, !522, !527, !532, !533, !538, !544, !559, !564, !569, !575, !580, !585, !590, !595, !600, !605, !610, !615, !620, !625, !639, !646, !652, !657, !662, !667, !672, !677, !682}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !438, file: !105, line: 1945, baseType: !188, size: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !438, file: !105, line: 1950, baseType: !442, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !105, line: 628, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !446}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !153, line: 43, baseType: !160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !438, file: !105, line: 1951, baseType: !448, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !105, line: 640, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !446}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !438, file: !105, line: 1956, baseType: !453, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !105, line: 187, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!213, !457, !458, !160, !459}
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !105, line: 46, baseType: !104)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !97, line: 107, baseType: !111)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !438, file: !105, line: 1957, baseType: !461, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !105, line: 208, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!213, !348, !160}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !438, file: !105, line: 1958, baseType: !466, size: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !105, line: 240, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!213, !252, !342, !252, !252, !376}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !438, file: !105, line: 1959, baseType: !471, size: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !105, line: 269, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!213, !458, !160, !358}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !438, file: !105, line: 1960, baseType: !476, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !105, line: 286, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!213, !6}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !438, file: !105, line: 1965, baseType: !481, size: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !105, line: 464, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!213, !179, !446, !485, !6, !489}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !105, line: 441, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !227, !6}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !438, file: !105, line: 1966, baseType: !491, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !105, line: 538, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!213, !227, !495, !161}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !105, line: 518, baseType: !129)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !438, file: !105, line: 1967, baseType: !497, size: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !105, line: 574, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!213, !160, !489, !252}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !438, file: !105, line: 1968, baseType: !502, size: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !105, line: 554, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!213, !227}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !438, file: !105, line: 1969, baseType: !507, size: 64, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !105, line: 590, baseType: !503)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !438, file: !105, line: 1970, baseType: !509, size: 64, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !105, line: 606, baseType: !503)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !438, file: !105, line: 1975, baseType: !511, size: 64, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !105, line: 1246, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!213, !515, !364, !516, !6}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !105, line: 1222, baseType: !134)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !438, file: !105, line: 1976, baseType: !518, size: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !105, line: 1296, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!213, !181, !364, !6, !6}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !438, file: !105, line: 1977, baseType: !523, size: 64, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !105, line: 1322, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!213, !181, !364, !6}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !438, file: !105, line: 1978, baseType: !528, size: 64, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !105, line: 1363, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!213, !181, !364, !358}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !438, file: !105, line: 1979, baseType: !6, size: 64, offset: 1280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !438, file: !105, line: 1980, baseType: !534, size: 64, offset: 1344)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !105, line: 1524, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!213, !364, !227, !358}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !438, file: !105, line: 1981, baseType: !539, size: 64, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !105, line: 1573, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!213, !543, !364, !6, !252, !515}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !105, line: 1547, baseType: !137)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !438, file: !105, line: 1982, baseType: !545, size: 64, offset: 1472)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !105, line: 1599, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!213, !364, !549, !515}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !552, line: 58, baseType: !553)
!552 = !DIFile(filename: "./Uefi/Protocol/DevicePath.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "b97c129759f8893462bd2c573bd0d83a")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 43, size: 32, elements: !554)
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !553, file: !552, line: 44, baseType: !172, size: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !553, file: !552, line: 51, baseType: !172, size: 8, offset: 8)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !553, file: !552, line: 56, baseType: !558, size: 16, offset: 16)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 16, elements: !163)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !438, file: !105, line: 1983, baseType: !560, size: 64, offset: 1536)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !105, line: 1620, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!213, !364, !6}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !438, file: !105, line: 1988, baseType: !565, size: 64, offset: 1600)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !105, line: 971, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!213, !143, !181, !550, !6, !160, !515}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !438, file: !105, line: 1989, baseType: !570, size: 64, offset: 1664)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !105, line: 996, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!213, !181, !252, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !438, file: !105, line: 1990, baseType: !576, size: 64, offset: 1728)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !105, line: 1024, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!213, !181, !213, !160, !197}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !438, file: !105, line: 1991, baseType: !581, size: 64, offset: 1792)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !105, line: 1042, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!213, !181}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !438, file: !105, line: 1992, baseType: !586, size: 64, offset: 1856)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !105, line: 1058, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!213, !181, !160}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !438, file: !105, line: 1997, baseType: !591, size: 64, offset: 1920)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !105, line: 1139, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!213, !428}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !438, file: !105, line: 1998, baseType: !596, size: 64, offset: 1984)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !105, line: 1074, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!213, !160}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !438, file: !105, line: 1999, baseType: !601, size: 64, offset: 2048)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !105, line: 1096, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!213, !160, !161, !160, !197}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !438, file: !105, line: 2004, baseType: !606, size: 64, offset: 2112)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !105, line: 345, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!213, !181, !515, !550, !143}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !438, file: !105, line: 2005, baseType: !611, size: 64, offset: 2176)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !105, line: 378, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!213, !181, !181, !181}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !438, file: !105, line: 2010, baseType: !616, size: 64, offset: 2240)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !105, line: 1405, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!213, !181, !364, !358, !181, !181, !179}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !438, file: !105, line: 2011, baseType: !621, size: 64, offset: 2304)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !105, line: 1437, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!213, !181, !364, !181, !181}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !438, file: !105, line: 2012, baseType: !626, size: 64, offset: 2368)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !105, line: 1471, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!213, !181, !364, !630, !252}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !105, line: 1452, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 1447, size: 192, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !633, file: !105, line: 1448, baseType: !181, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !633, file: !105, line: 1449, baseType: !181, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !633, file: !105, line: 1450, baseType: !179, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !633, file: !105, line: 1451, baseType: !179, size: 32, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !438, file: !105, line: 2017, baseType: !640, size: 64, offset: 2432)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !105, line: 1501, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!213, !181, !644, !252}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !438, file: !105, line: 2018, baseType: !647, size: 64, offset: 2496)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !105, line: 1646, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!213, !543, !364, !6, !252, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !438, file: !105, line: 2019, baseType: !653, size: 64, offset: 2560)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !105, line: 1673, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!213, !364, !6, !358}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !438, file: !105, line: 2020, baseType: !658, size: 64, offset: 2624)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !105, line: 1271, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!213, !515, null}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !438, file: !105, line: 2021, baseType: !663, size: 64, offset: 2688)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !105, line: 1341, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!213, !181, null}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !438, file: !105, line: 2026, baseType: !668, size: 64, offset: 2752)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !105, line: 1176, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!213, !6, !160, !376}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !438, file: !105, line: 2031, baseType: !673, size: 64, offset: 2816)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !105, line: 1192, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !6, !6, !160}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !438, file: !105, line: 2032, baseType: !678, size: 64, offset: 2880)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !105, line: 1208, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !6, !160, !172}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !438, file: !105, line: 2033, baseType: !683, size: 64, offset: 2944)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !105, line: 493, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!213, !179, !446, !485, !687, !689, !489}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !185, file: !105, line: 2109, baseType: !160, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !185, file: !105, line: 2114, baseType: !693, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !105, line: 2049, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 2040, size: 192, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !695, file: !105, line: 2044, baseType: !365, size: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !695, file: !105, line: 2048, baseType: !6, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !176, file: !175, line: 53, baseType: !181, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "FilePath", scope: !176, file: !175, line: 54, baseType: !550, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !176, file: !175, line: 56, baseType: !6, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptionsSize", scope: !176, file: !175, line: 61, baseType: !179, size: 32, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptions", scope: !176, file: !175, line: 62, baseType: !6, size: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !176, file: !175, line: 67, baseType: !6, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !176, file: !175, line: 68, baseType: !161, size: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeType", scope: !176, file: !175, line: 69, baseType: !458, size: 32, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataType", scope: !176, file: !175, line: 70, baseType: !458, size: 32, offset: 672)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Unload", scope: !176, file: !175, line: 71, baseType: !581, size: 64, offset: 704)
!709 = !{!91, !710, !729, !731, !733, !735, !737, !739, !751, !764, !766, !768, !770, !783}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "RngProtocol", scope: !93, file: !148, line: 24, type: !712, isLocal: false, isDefinition: true)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_PROTOCOL", file: !714, line: 22, baseType: !715)
!714 = !DIFile(filename: "./../Demo1_Alice/../Demo1_Access_Key/Protocol/Rng.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "1128b15f0582c0f8bfa33dc5c07b9582")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_RNG_PROTOCOL", file: !714, line: 137, size: 128, elements: !716)
!716 = !{!717, !724}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !715, file: !714, line: 138, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_GET_INFO", file: !714, line: 96, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!213, !712, !252, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_ALGORITHM", file: !714, line: 30, baseType: !365)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "GetRNG", scope: !715, file: !714, line: 139, baseType: !725, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RNG_GET_RNG", file: !714, line: 126, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!213, !712, !722, !160, !171}
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "masterKey", scope: !93, file: !148, line: 25, type: !392, isLocal: false, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "accessKeyLock", scope: !93, file: !148, line: 28, type: !143, isLocal: false, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "head", scope: !93, file: !148, line: 40, type: !146, isLocal: false, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "last", scope: !93, file: !148, line: 41, type: !146, isLocal: false, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "keychain", scope: !93, file: !148, line: 42, type: !146, isLocal: false, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "gDemo1_Bob_Protocol", scope: !93, file: !94, line: 20, type: !741, isLocal: false, isDefinition: true)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Bob_PROTOCOL", file: !742, line: 35, baseType: !743)
!742 = !DIFile(filename: "./Demo1_Bob.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "4fa74dec5a92cd7311066f39f790ce53")
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Bob_PROTOCOL", file: !742, line: 52, size: 64, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1BobDataProvider", scope: !743, file: !742, line: 53, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOB_CB_TYPE", file: !742, line: 42, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!213, !750, !6, !358, !160}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "AccessKeyProtocol", scope: !93, file: !94, line: 25, type: !753, isLocal: false, isDefinition: true)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Access_Key_PROTOCOL", file: !755, line: 36, baseType: !756)
!755 = !DIFile(filename: "./../Demo1_Access_Key/Demo1_Access_Key.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "a5dbaf8c3ac310b99ce95abca155b547")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Access_Key_PROTOCOL", file: !755, line: 72, size: 128, elements: !757)
!757 = !{!758, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1GenerateAccessKey", scope: !756, file: !755, line: 73, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRVR_FUNC_CB_TYPE1", file: !755, line: 51, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!213, !753, !181, !143, !392}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1_Ready_To_Lock_Event", scope: !756, file: !755, line: 75, baseType: !227, size: 64, offset: 64)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "Demo1_Bob_PeriodicTimer", scope: !93, file: !94, line: 30, type: !227, isLocal: false, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "DataToProvide", scope: !93, file: !94, line: 31, type: !160, isLocal: false, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "gLoadImage", scope: !93, file: !94, line: 32, type: !173, isLocal: false, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "AliceProtocol", scope: !93, file: !94, line: 26, type: !772, isLocal: false, isDefinition: true)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Alice_PROTOCOL", file: !774, line: 36, baseType: !775)
!774 = !DIFile(filename: "./../Demo1_Alice/Demo1_Alice.h", directory: "/home/hira/Research/HARDEN/repositories/HARDEN_demo1/edk2/EmulatorPkg/Demo1_Bob", checksumkind: CSK_MD5, checksum: "a1a6c09027689aba8f236cb5bb922cff")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Alice_PROTOCOL", file: !774, line: 56, size: 128, elements: !776)
!776 = !{!777, !782}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1AliceProvideData", scope: !775, file: !774, line: 57, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALICE_CB_TYPE", file: !774, line: 47, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!213, !772, !181, !252}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1_Ready_To_Run_Event", scope: !775, file: !774, line: 58, baseType: !227, size: 64, offset: 64)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "bobKey", scope: !93, file: !94, line: 29, type: !152, isLocal: false, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "letters", scope: !787, file: !788, line: 135, type: !797, isLocal: true, isDefinition: true)
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !789, globals: !790, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "libc/misc/internals/tempname.c", directory: "/home/hira/Research/klee-uclibc")
!789 = !{!6, !17}
!790 = !{!791, !785}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "value", scope: !793, file: !788, line: 159, type: !17, isLocal: true, isDefinition: true)
!793 = distinct !DISubprogram(name: "brain_damaged_fillrand", scope: !788, file: !788, line: 154, type: !794, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !787, retainedNodes: !4)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !796, !98}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 504, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 63)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !802, file: !836, line: 375, type: !1074, isLocal: false, isDefinition: true)
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "Ubuntu clang version 11.1.0-6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !804, retainedTypes: !826, globals: !878, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/hira/Research/klee-uclibc")
!804 = !{!805, !811}
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 90, baseType: !98, size: 32, elements: !807)
!806 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/hira/Research/klee-uclibc")
!807 = !{!808, !809, !810}
!808 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0, isUnsigned: true)
!809 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1, isUnsigned: true)
!810 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2, isUnsigned: true)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !812, line: 48, baseType: !98, size: 32, elements: !813)
!812 = !DIFile(filename: "./include/ctype.h", directory: "/home/hira/Research/klee-uclibc")
!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!814 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!815 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!816 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!817 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!818 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!819 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!820 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!821 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!822 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!823 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!824 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!825 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!826 = !{!45, !827, !7, !828, !830, !833, !145, !796, !834, !847, !855, !10}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !199)
!833 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !836, line: 400, baseType: !837)
!836 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/hira/Research/klee-uclibc")
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !836, line: 390, size: 128, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !837, file: !836, line: 391, baseType: !832, size: 16)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !837, file: !836, line: 392, baseType: !832, size: 16, offset: 16)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !837, file: !836, line: 393, baseType: !832, size: 16, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !837, file: !836, line: 394, baseType: !832, size: 16, offset: 48)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !837, file: !836, line: 396, baseType: !832, size: 16, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !837, file: !836, line: 397, baseType: !832, size: 16, offset: 80)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !837, file: !836, line: 398, baseType: !832, size: 16, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !837, file: !836, line: 399, baseType: !832, size: 16, offset: 112)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !836, line: 430, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !836, line: 425, size: 64, elements: !850)
!850 = !{!851, !852, !853, !854}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !849, file: !836, line: 426, baseType: !832, size: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !849, file: !836, line: 427, baseType: !832, size: 16, offset: 16)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !849, file: !836, line: 428, baseType: !832, size: 16, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !849, file: !836, line: 429, baseType: !832, size: 16, offset: 48)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !836, line: 423, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !836, line: 402, size: 304, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !857, file: !836, line: 403, baseType: !832, size: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !857, file: !836, line: 404, baseType: !832, size: 16, offset: 16)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !857, file: !836, line: 405, baseType: !832, size: 16, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !857, file: !836, line: 406, baseType: !832, size: 16, offset: 48)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !857, file: !836, line: 407, baseType: !832, size: 16, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !857, file: !836, line: 408, baseType: !832, size: 16, offset: 80)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !857, file: !836, line: 409, baseType: !832, size: 16, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !857, file: !836, line: 410, baseType: !832, size: 16, offset: 112)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !857, file: !836, line: 411, baseType: !832, size: 16, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !857, file: !836, line: 412, baseType: !832, size: 16, offset: 144)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !857, file: !836, line: 413, baseType: !832, size: 16, offset: 160)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !857, file: !836, line: 414, baseType: !832, size: 16, offset: 176)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !857, file: !836, line: 415, baseType: !832, size: 16, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !857, file: !836, line: 416, baseType: !832, size: 16, offset: 208)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !857, file: !836, line: 418, baseType: !832, size: 16, offset: 224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !857, file: !836, line: 419, baseType: !832, size: 16, offset: 240)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !857, file: !836, line: 420, baseType: !832, size: 16, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !857, file: !836, line: 421, baseType: !832, size: 16, offset: 272)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !857, file: !836, line: 422, baseType: !832, size: 16, offset: 288)
!878 = !{!879, !1062, !800, !1064, !1067, !1069}
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "__global_locale", scope: !802, file: !836, line: 377, type: !881, isLocal: false, isDefinition: true)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !806, line: 330, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !806, line: 154, size: 26560, elements: !884)
!884 = !{!885, !892, !897, !898, !902, !904, !905, !909, !913, !915, !916, !917, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !936, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !883, file: !806, line: 156, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !889, line: 38, baseType: !890)
!889 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/hira/Research/klee-uclibc")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !891, line: 44, baseType: !199)
!891 = !DIFile(filename: "./include/bits/types.h", directory: "/home/hira/Research/klee-uclibc")
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !883, file: !806, line: 157, baseType: !893, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !889, line: 42, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !891, line: 43, baseType: !311)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !883, file: !806, line: 158, baseType: !893, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !883, file: !806, line: 162, baseType: !899, size: 6144, offset: 192)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 6144, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !883, file: !806, line: 163, baseType: !903, size: 6144, offset: 6336)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 6144, elements: !900)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !883, file: !806, line: 164, baseType: !903, size: 6144, offset: 12480)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !883, file: !806, line: 168, baseType: !906, size: 112, offset: 18624)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 112, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 14)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !883, file: !806, line: 174, baseType: !910, size: 96, offset: 18736)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 96, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 6)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !883, file: !806, line: 175, baseType: !914, size: 48, offset: 18832)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 48, elements: !911)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !883, file: !806, line: 178, baseType: !145, size: 8, offset: 18880)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !883, file: !806, line: 179, baseType: !145, size: 8, offset: 18888)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !883, file: !806, line: 180, baseType: !918, size: 80, offset: 18896)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 80, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 10)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !883, file: !806, line: 183, baseType: !828, size: 64, offset: 19008)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !883, file: !806, line: 184, baseType: !828, size: 64, offset: 19072)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !883, file: !806, line: 185, baseType: !828, size: 64, offset: 19136)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !883, file: !806, line: 186, baseType: !828, size: 64, offset: 19200)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !883, file: !806, line: 188, baseType: !828, size: 64, offset: 19264)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !883, file: !806, line: 189, baseType: !830, size: 64, offset: 19328)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !883, file: !806, line: 190, baseType: !828, size: 64, offset: 19392)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !883, file: !806, line: 191, baseType: !828, size: 64, offset: 19456)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !883, file: !806, line: 197, baseType: !830, size: 64, offset: 19520)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !883, file: !806, line: 199, baseType: !828, size: 64, offset: 19584)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !883, file: !806, line: 200, baseType: !828, size: 64, offset: 19648)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !883, file: !806, line: 202, baseType: !933, size: 64, offset: 19712)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !311)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !883, file: !806, line: 205, baseType: !937, size: 32, offset: 19776)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !883, file: !806, line: 206, baseType: !937, size: 32, offset: 19808)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !883, file: !806, line: 207, baseType: !45, size: 32, offset: 19840)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !883, file: !806, line: 208, baseType: !45, size: 32, offset: 19872)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !883, file: !806, line: 213, baseType: !29, size: 64, offset: 19904)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !883, file: !806, line: 214, baseType: !29, size: 64, offset: 19968)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !883, file: !806, line: 215, baseType: !29, size: 64, offset: 20032)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !883, file: !806, line: 216, baseType: !29, size: 64, offset: 20096)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !883, file: !806, line: 217, baseType: !29, size: 64, offset: 20160)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !883, file: !806, line: 218, baseType: !29, size: 64, offset: 20224)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !883, file: !806, line: 219, baseType: !29, size: 64, offset: 20288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !883, file: !806, line: 220, baseType: !29, size: 64, offset: 20352)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !883, file: !806, line: 221, baseType: !29, size: 64, offset: 20416)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !883, file: !806, line: 222, baseType: !29, size: 64, offset: 20480)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !883, file: !806, line: 223, baseType: !29, size: 64, offset: 20544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !883, file: !806, line: 226, baseType: !29, size: 64, offset: 20608)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !883, file: !806, line: 227, baseType: !29, size: 64, offset: 20672)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !883, file: !806, line: 228, baseType: !29, size: 64, offset: 20736)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !883, file: !806, line: 231, baseType: !29, size: 64, offset: 20800)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !883, file: !806, line: 232, baseType: !29, size: 64, offset: 20864)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !883, file: !806, line: 233, baseType: !29, size: 64, offset: 20928)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !883, file: !806, line: 234, baseType: !29, size: 64, offset: 20992)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !883, file: !806, line: 235, baseType: !29, size: 64, offset: 21056)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !883, file: !806, line: 236, baseType: !29, size: 64, offset: 21120)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !883, file: !806, line: 237, baseType: !29, size: 64, offset: 21184)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !883, file: !806, line: 238, baseType: !29, size: 64, offset: 21248)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !883, file: !806, line: 239, baseType: !29, size: 64, offset: 21312)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !883, file: !806, line: 240, baseType: !29, size: 64, offset: 21376)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !883, file: !806, line: 241, baseType: !29, size: 64, offset: 21440)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !883, file: !806, line: 242, baseType: !29, size: 64, offset: 21504)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !883, file: !806, line: 243, baseType: !29, size: 64, offset: 21568)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !883, file: !806, line: 244, baseType: !29, size: 64, offset: 21632)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !883, file: !806, line: 245, baseType: !29, size: 64, offset: 21696)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !883, file: !806, line: 246, baseType: !29, size: 64, offset: 21760)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !883, file: !806, line: 247, baseType: !29, size: 64, offset: 21824)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !883, file: !806, line: 248, baseType: !29, size: 64, offset: 21888)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !883, file: !806, line: 249, baseType: !29, size: 64, offset: 21952)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !883, file: !806, line: 250, baseType: !29, size: 64, offset: 22016)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !883, file: !806, line: 251, baseType: !29, size: 64, offset: 22080)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !883, file: !806, line: 253, baseType: !29, size: 64, offset: 22144)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !883, file: !806, line: 256, baseType: !29, size: 64, offset: 22208)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !883, file: !806, line: 257, baseType: !29, size: 64, offset: 22272)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !883, file: !806, line: 258, baseType: !29, size: 64, offset: 22336)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !883, file: !806, line: 259, baseType: !29, size: 64, offset: 22400)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !883, file: !806, line: 260, baseType: !29, size: 64, offset: 22464)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !883, file: !806, line: 261, baseType: !29, size: 64, offset: 22528)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !883, file: !806, line: 262, baseType: !29, size: 64, offset: 22592)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !883, file: !806, line: 264, baseType: !29, size: 64, offset: 22656)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !883, file: !806, line: 265, baseType: !29, size: 64, offset: 22720)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !883, file: !806, line: 266, baseType: !29, size: 64, offset: 22784)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !883, file: !806, line: 267, baseType: !29, size: 64, offset: 22848)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !883, file: !806, line: 268, baseType: !29, size: 64, offset: 22912)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !883, file: !806, line: 269, baseType: !29, size: 64, offset: 22976)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !883, file: !806, line: 270, baseType: !29, size: 64, offset: 23040)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !883, file: !806, line: 272, baseType: !29, size: 64, offset: 23104)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !883, file: !806, line: 273, baseType: !29, size: 64, offset: 23168)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !883, file: !806, line: 274, baseType: !29, size: 64, offset: 23232)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !883, file: !806, line: 275, baseType: !29, size: 64, offset: 23296)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !883, file: !806, line: 276, baseType: !29, size: 64, offset: 23360)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !883, file: !806, line: 277, baseType: !29, size: 64, offset: 23424)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !883, file: !806, line: 278, baseType: !29, size: 64, offset: 23488)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !883, file: !806, line: 279, baseType: !29, size: 64, offset: 23552)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !883, file: !806, line: 280, baseType: !29, size: 64, offset: 23616)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !883, file: !806, line: 281, baseType: !29, size: 64, offset: 23680)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !883, file: !806, line: 282, baseType: !29, size: 64, offset: 23744)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !883, file: !806, line: 283, baseType: !29, size: 64, offset: 23808)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !883, file: !806, line: 285, baseType: !29, size: 64, offset: 23872)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !883, file: !806, line: 286, baseType: !29, size: 64, offset: 23936)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !883, file: !806, line: 287, baseType: !29, size: 64, offset: 24000)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !883, file: !806, line: 288, baseType: !29, size: 64, offset: 24064)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !883, file: !806, line: 289, baseType: !29, size: 64, offset: 24128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !883, file: !806, line: 290, baseType: !29, size: 64, offset: 24192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !883, file: !806, line: 291, baseType: !29, size: 64, offset: 24256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !883, file: !806, line: 292, baseType: !29, size: 64, offset: 24320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !883, file: !806, line: 293, baseType: !29, size: 64, offset: 24384)
